; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v5 ?v1)
             (pred_10 ?v9 ?v13)
             (pred_9 ?v5 ?v13)
             (pred_8 ?v8 ?v5 )
	     (pred_7 ?v5)
             (pred_12 ?v10)
             (pred_5 ?v9)
             (pred_1 ?v13)
             (pred_11 ?v5)
             (pred_4 ?v9)
             (pred_3 ?v5)
             (pred_6 ))



(:action op_2
:parameters (?v7 ?v11 ?v2 ?v4)
:precondition (and (pred_12 ?v7) (pred_12 ?v11) (pred_5 ?v2) (pred_1 ?v4)
          (pred_2 ?v7 ?v11) (pred_10 ?v2 ?v4)
                   (pred_9 ?v11 ?v4) (pred_7 ?v7) 
                   (pred_11 ?v11) (pred_4 ?v2))
:effect (and  (pred_3 ?v11) (not (pred_11 ?v11))))


(:action op_1
:parameters (?v7 ?v6)
:precondition (and (pred_12 ?v7) (pred_12 ?v6)
               (pred_7 ?v7) (pred_2 ?v7 ?v6) (pred_3 ?v6))
:effect (and (pred_7 ?v6) (not (pred_7 ?v7))))

(:action op_4
:parameters (?v7 ?v2)
:precondition (and (pred_12 ?v7) (pred_5 ?v2) 
                  (pred_7 ?v7) (pred_8 ?v2 ?v7) (pred_6 ))
:effect (and (pred_4 ?v2)
   (not (pred_8 ?v2 ?v7)) (not (pred_6 ))))


(:action op_5
:parameters (?v7 ?v3 ?v12)
:precondition (and (pred_12 ?v7) (pred_5 ?v3) (pred_5 ?v12)
                  (pred_7 ?v7) (pred_4 ?v12) (pred_8 ?v3 ?v7))
:effect (and (pred_4 ?v3) (pred_8 ?v12 ?v7)
        (not (pred_4 ?v12)) (not (pred_8 ?v3 ?v7))))

(:action op_3
:parameters (?v7 ?v2)
:precondition (and (pred_12 ?v7) (pred_5 ?v2) 
                  (pred_7 ?v7) (pred_4 ?v2))
:effect (and (pred_6 ) (pred_8 ?v2 ?v7) (not (pred_4 ?v2)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_12 obj_05 obj_01 obj_07 obj_02 obj_22 obj_06 obj_15 obj_08 obj_10 obj_11 obj_17 obj_20 obj_04 obj_09
    obj_16 obj_13 obj_03
    obj_14 obj_19 obj_18
    )

    (:init
       (pred_6)

       (pred_12 obj_21)
       (pred_12 obj_12)
       (pred_12 obj_05)
       (pred_12 obj_01)
       (pred_12 obj_07)
       (pred_12 obj_02)
       (pred_12 obj_22)
       (pred_12 obj_06)
       (pred_12 obj_15)
       (pred_12 obj_08)
       (pred_12 obj_10)
       (pred_12 obj_11)
       (pred_12 obj_17)
       (pred_12 obj_20)
       (pred_12 obj_04)
       (pred_12 obj_09)
       (pred_1 obj_16)
       (pred_1 obj_13)
       (pred_1 obj_03)
       (pred_5 obj_14)
       (pred_5 obj_19)
       (pred_5 obj_18)

       (pred_2 obj_21 obj_07)
       (pred_2 obj_21 obj_12)
       (pred_2 obj_12 obj_02)
       (pred_2 obj_12 obj_05)
       (pred_2 obj_12 obj_21)
       (pred_2 obj_05 obj_22)
       (pred_2 obj_05 obj_01)
       (pred_2 obj_05 obj_12)
       (pred_2 obj_01 obj_06)
       (pred_2 obj_01 obj_05)
       (pred_2 obj_07 obj_15)
       (pred_2 obj_07 obj_02)
       (pred_2 obj_07 obj_21)
       (pred_2 obj_02 obj_08)
       (pred_2 obj_02 obj_22)
       (pred_2 obj_02 obj_12)
       (pred_2 obj_02 obj_07)
       (pred_2 obj_22 obj_10)
       (pred_2 obj_22 obj_06)
       (pred_2 obj_22 obj_05)
       (pred_2 obj_22 obj_02)
       (pred_2 obj_06 obj_11)
       (pred_2 obj_06 obj_01)
       (pred_2 obj_06 obj_22)
       (pred_2 obj_15 obj_17)
       (pred_2 obj_15 obj_08)
       (pred_2 obj_15 obj_07)
       (pred_2 obj_08 obj_20)
       (pred_2 obj_08 obj_10)
       (pred_2 obj_08 obj_02)
       (pred_2 obj_08 obj_15)
       (pred_2 obj_10 obj_04)
       (pred_2 obj_10 obj_11)
       (pred_2 obj_10 obj_22)
       (pred_2 obj_10 obj_08)
       (pred_2 obj_11 obj_09)
       (pred_2 obj_11 obj_06)
       (pred_2 obj_11 obj_10)
       (pred_2 obj_17 obj_20)
       (pred_2 obj_17 obj_15)
       (pred_2 obj_20 obj_04)
       (pred_2 obj_20 obj_08)
       (pred_2 obj_20 obj_17)
       (pred_2 obj_04 obj_09)
       (pred_2 obj_04 obj_10)
       (pred_2 obj_04 obj_20)
       (pred_2 obj_09 obj_11)
       (pred_2 obj_09 obj_04)
       (pred_11 obj_09)
       (pred_11 obj_12)
       (pred_11 obj_20)
       (pred_9  obj_09 obj_16)
       (pred_9  obj_12 obj_13)
       (pred_9  obj_20 obj_03)
       (pred_3 obj_21)
       (pred_3 obj_05)
       (pred_3 obj_01)
       (pred_3 obj_07)
       (pred_3 obj_02)
       (pred_3 obj_22)
       (pred_3 obj_06)
       (pred_3 obj_15)
       (pred_3 obj_08)
       (pred_3 obj_10)
       (pred_3 obj_11)
       (pred_3 obj_17)
       (pred_3 obj_04)

       (pred_10  obj_14 obj_16)
       (pred_10  obj_19 obj_13)
       (pred_10  obj_18 obj_03)
       (pred_8 obj_14 obj_11)
       (pred_8 obj_19 obj_10)
       (pred_8 obj_18 obj_22)
       (pred_7 obj_06)
    )

    (:goal (and
       (pred_8 obj_18 obj_17)
    ))
(:constraints
  (always (not (pred_7 obj_02)))
)
)

; plan
1. (op_1 obj_06 obj_22)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_22)
   goals met: 0 of 1
2. (op_4 obj_22 obj_18)
   deleted: (pred_8 obj_18 obj_22) (pred_6)
   added: (pred_4 obj_18)
   goals met: 0 of 1
3. (op_1 obj_22 obj_10)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_10)
   goals met: 0 of 1
4. (op_1 obj_10 obj_08)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_08)
   goals met: 0 of 1
5. (op_1 obj_08 obj_15)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_15)
   goals met: 0 of 1
6. (op_1 obj_15 obj_17)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_17)
   goals met: 0 of 1
7. (op_3 obj_17 obj_18)
   deleted: (pred_4 obj_18)
   added: (pred_6) (pred_8 obj_18 obj_17)
   goals met: 1 of 1
